cfg/InformationRegisters/ПериодическиеЗначенияПоказателейСхемМотивации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПериодическиеЗначенияПоказателейСхемМотивации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиСхемМотивации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыОрганизационнойСтруктурыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОрганизационнойСтруктурыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтруктуреЮридическихЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦентрамОтветственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/InformationRegisters/ПериодическиеЗначенияПоказателейСхемМотивации/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мЗаголовокФормы;
Перем мРежимВводаПоказателей;

Перем мОрганизация;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает свертку панелей и видимость реквизитов формы в зависимости от выбранной организационной структуры 
//
Процедура ВидОрганизационнойСтруктурыПредприятияПриИзменении()
	
	Если мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда		
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоЦФО.Пометка = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоОрганизациям.Пометка = Истина;
		ЭлементыФормы.ПанельОрганизации.Свертка = РежимСверткиЭлементаУправления.Нет;	
		ОрганизацияПриИзменении();
	Иначе
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоЦФО.Пометка = Истина;
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоОрганизациям.Пометка = Ложь;
		ЭлементыФормы.ПанельОрганизации.Свертка = РежимСверткиЭлементаУправления.Верх;
		Отбор.Организация.Значение = Справочники.Организации.ПустаяСсылка();
		ОрганизацияПриИзменении("ПоЦФО")
	КонецЕсли;

КонецПроцедуры //ВидОрганизационнойСтруктурыПредприятияПриИзменении

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	мРежимВводаПоказателей = ВосстановитьЗначение("РежимВводаПоказателей");
	
КонецПроцедуры //ПередОткрытием


// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()
		
	мЗаголовокФормы = НСтр("ru='Периодические значения показателей схем мотивации ';uk='Періодичні значення показників схем мотивації '");
	
	Если НЕ ЗначениеЗаполнено(мРежимВводаПоказателей) Тогда
		мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоОрганизациям.Пометка = Истина;
	Иначе
		ЭлементыФормы.ДействияФормы.Кнопки.ПорядокФормированияСМ.Кнопки.ПоЦФО.Пометка = Истина;
	КонецЕсли;

	// заполним организацию
	РаботаСДиалогами.ЗаполнениеОтбораПоОрганизацииПоУмолчанию(ЭтаФорма, Отбор.Организация, ЭлементыФормы.Организация, Неопределено, Ложь, глЗначениеПеременной("глТекущийПользователь"));
	
	мОрганизация = Отбор.Организация.Значение;
	
	Отбор.Организация.Использование = Истина;
	Если Не ЗначениеЗаполнено(Отбор.Организация.Значение) Тогда
		Отбор.Организация.ВидСравнения	= ВидСравнения.НеРавно;
	КонецЕсли;
	
	
	ВидОрганизационнойСтруктурыПредприятияПриИзменении();

	Заголовок = мЗаголовокФормы + ?(ЗначениеЗаполнено(Отбор.Организация.Значение),"по " + Строка(Отбор.Организация.Значение) + " ","");
	
	РегистрСведенийСписок.Порядок.Установить("Подразделение,Показатель");
	
КонецПроцедуры //ПриОткрытии

// Процедура - обработчик события "ПриЗакрытии" формы.
//
Процедура ПриЗакрытии()
	
	СохранитьЗначение("РежимВводаПоказателей",мРежимВводаПоказателей);
	
КонецПроцедуры //ПриЗакрытии

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ



Процедура ДействияФормыПоОрганизациям(Кнопка)
	
	мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;	
	Если Не ЗначениеЗаполнено(Отбор.Организация.Значение) Тогда
		
		Если мОрганизация = Неопределено Тогда
			// заполним организацию
			РаботаСДиалогами.ЗаполнениеОтбораПоОрганизацииПоУмолчанию(ЭтаФорма, Отбор.Организация, ЭлементыФормы.Организация, Неопределено, Ложь, глЗначениеПеременной("глТекущийПользователь"));
			
			Отбор.Организация.Использование = Истина;
			Если Не ЗначениеЗаполнено(Отбор.Организация.Значение) Тогда
				Отбор.Организация.ВидСравнения	= ВидСравнения.НеРавно;
			КонецЕсли;
		Иначе
			Отбор.Организация.Значение = мОрганизация;
		КОнецЕсли;
	КонецЕсли;
	ВидОрганизационнойСтруктурыПредприятияПриИзменении();
	
КонецПроцедуры

Процедура ДействияФормыПоЦФО(Кнопка)
	
	мОрганизация = Отбор.Организация.Значение;
	мРежимВводаПоказателей = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности;
	ВидОрганизационнойСтруктурыПредприятияПриИзменении();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ



// Процедура - обработчик события "ОрганизацияПриИзменении"
//
Процедура ОрганизацияПриИзменении(РежимВвода = "")
	
	Организация = Отбор.Организация.Значение;
	
	Если Организация = Справочники.Организации.ПустаяСсылка() И (РежимВвода <> "ПоЦФО") Тогда
		Отбор.Организация.ВидСравнения	= ВидСравнения.НеРавно;
	Иначе
		Отбор.Организация.ВидСравнения	= ВидСравнения.Равно;
	КонецЕсли;	
	Заголовок = мЗаголовокФормы + ?(ЗначениеЗаполнено(Отбор.Организация.Значение),НСтр("ru='по ';uk='по'") + Строка(Отбор.Организация.Значение) + " ","");
	

КонецПроцедуры
